test/cassettes/CREATE_should_create_cit_payment_when_espago_client_id_payment_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.espago.com/api/charges
    body:
      encoding: UTF-8
      string: '{"amount":"10.0","currency":"PLN","description":"pay_7b0cea51-ebce-41bd-922b-1d5121eb38ec","positive_url":"http://localhost:3001/payments/pay_7b0cea51-ebce-41bd-922b-1d5121eb38ec/success","negative_url":"http://localhost:3001/payments/pay_7b0cea51-ebce-41bd-922b-1d5121eb38ec/rejected","client":"cli_9d05-phkJnJOajc0"}'
    headers:
      User-Agent:
      - Faraday v2.13.1
      Accept:
      - application/vnd.espago.v3+json
      Authorization:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: ''
    headers:
      Date:
      - Mon, 15 Dec 2025 20:54:42 GMT
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"56c038a02bbf6b395bb5195a52b149b0"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains; preload
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - default-src 'none'; base-uri 'none'; block-all-mixed-content; child-src 'self'
        sandbox.espago.com sandbox-static.espago.com; connect-src 'self' sandbox.espago.com
        sandbox-static.espago.com; font-src 'self' sandbox.espago.com sandbox-static.espago.com;
        form-action 'self' sandbox.espago.com sandbox-static.espago.com; img-src 'self'
        sandbox.espago.com sandbox-static.espago.com; manifest-src 'none'; media-src
        'none'; object-src 'none'; script-src 'self' sandbox.espago.com sandbox-static.espago.com;
        style-src 'self' sandbox.espago.com sandbox-static.espago.com; upgrade-insecure-requests;
        worker-src 'none'; report-uri https://csp-report.espago.com/csp_app0_sandbox/store
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: '{"id":"pay_9d0o1XDgiIi4qxda","description":"pay_7b0cea51-ebce-41bd-922b-1d5121eb38ec","channel":"elavon","amount":"10.00","currency":"PLN","state":"new","client":"cli_9d05-phkJnJOajc0","created_at":1765832082,"card":{"company":"VI","last4":"0006","year":2028,"month":1,"first_name":"John","last_name":"Doe","authorized":null,"card_identifier":"cid_9cfzW0qxuoyOOi5h","created_at":1765831439},"issuer_response_code":"","transaction_id":"tr_9d02K06fd","redirect_url":"https://sandbox.espago.com/secure_web_page/pay_9d0o1XDgiIi4qxda","tokenization_used":false}'
  recorded_at: Mon, 15 Dec 2025 20:54:42 GMT
recorded_with: VCR 6.3.1
