test/cassettes/CREATE_should_create_secure_web_page_payment_when_secure_web_page_payment_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.espago.com/api/secure_web_page_register
    body:
      encoding: UTF-8
      string: '{"amount":"10.0","currency":"PLN","kind":"sale","title":"pay_7d27b3ec-4217-4850-82e5-3b91f733a5b7","description":"pay_7d27b3ec-4217-4850-82e5-3b91f733a5b7","positive_url":"http://localhost:3001/payments/pay_7d27b3ec-4217-4850-82e5-3b91f733a5b7/success","negative_url":"http://localhost:3001/payments/pay_7d27b3ec-4217-4850-82e5-3b91f733a5b7/rejected","session_id":"96dacedd2bb696e456a7d473870c04e9","checksum":"bcad2b2ad625050291f180dd62028551"}'
    headers:
      User-Agent:
      - Faraday v2.13.1
      Accept:
      - application/vnd.espago.v3+json
      Authorization:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: ''
    headers:
      Date:
      - Mon, 15 Dec 2025 20:11:39 GMT
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"d07aef106d39152067107103e219add7"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 96ee0551-c71f-4678-8c53-c816cbe499a3
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains; preload
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - default-src 'none'; base-uri 'none'; block-all-mixed-content; child-src 'self'
        sandbox.espago.com sandbox-static.espago.com; connect-src 'self' sandbox.espago.com
        sandbox-static.espago.com; font-src 'self' sandbox.espago.com sandbox-static.espago.com;
        form-action 'self' sandbox.espago.com sandbox-static.espago.com; img-src 'self'
        sandbox.espago.com sandbox-static.espago.com; manifest-src 'none'; media-src
        'none'; object-src 'none'; script-src 'self' sandbox.espago.com sandbox-static.espago.com;
        style-src 'self' sandbox.espago.com sandbox-static.espago.com; upgrade-insecure-requests;
        worker-src 'none'; report-uri https://csp-report.espago.com/csp_app0_sandbox/store
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: '{"id":"pay_9d051aEMj96TCoNC","description":"pay_7d27b3ec-4217-4850-82e5-3b91f733a5b7","channel":"elavon","amount":"10.00","currency":"PLN","state":"new","client":"cli_9d0AqnuxuAdaBguA","created_at":1765829499,"redirect_url":"https://sandbox.espago.com/secure_web_page/pay_9d051aEMj96TCoNC"}'
  recorded_at: Mon, 15 Dec 2025 20:11:39 GMT
recorded_with: VCR 6.3.1
