test/cassettes/REVERSE_should_reverse_payment.yml

---
http_interactions:
- request:
    method: delete
    uri: https://sandbox.espago.com/api/charges/pay_9d0MB60taOJrWmqn
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v2.13.1
      Accept:
      - application/vnd.espago.v3+json
      Authorization:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Mon, 15 Dec 2025 22:27:12 GMT
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"518cec78d6130a3e097bb7872ee56e8a"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains; preload
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - default-src 'none'; base-uri 'none'; block-all-mixed-content; child-src 'self'
        sandbox.espago.com sandbox-static.espago.com; connect-src 'self' sandbox.espago.com
        sandbox-static.espago.com; font-src 'self' sandbox.espago.com sandbox-static.espago.com;
        form-action 'self' sandbox.espago.com sandbox-static.espago.com; img-src 'self'
        sandbox.espago.com sandbox-static.espago.com; manifest-src 'none'; media-src
        'none'; object-src 'none'; script-src 'self' sandbox.espago.com sandbox-static.espago.com;
        style-src 'self' sandbox.espago.com sandbox-static.espago.com; upgrade-insecure-requests;
        worker-src 'none'; report-uri https://csp-report.espago.com/csp_app0_sandbox/store
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: '{"id":"pay_9d0MB60taOJrWmqn","description":"pay_d7c01a2b-ef0e-41a0-985e-20350e6fa98c","channel":"elavon","amount":"12.50","currency":"PLN","state":"reversed","client":"cli_9d0qBIJUvl4-q1l6","created_at":1765837492,"card":{"company":"VI","last4":"0006","year":2028,"month":1,"first_name":"John","last_name":"Doe","authorized":null,"card_identifier":"cid_9cfzW0qxuoyOOi5h","created_at":1765837494},"issuer_response_code":"00","transaction_id":"tr_9d0dZI3BP","tokenization_used":false}'
  recorded_at: Mon, 15 Dec 2025 22:27:12 GMT
recorded_with: VCR 6.3.1
